cases/advection/3Dshear/lent-hex-shear/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     lentReconstruct;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         3;

deltaT          0.005;

/*writeControl    adjustableRunTime;*/

/*writeInterval   0.1;*/

writeControl    timeStep;

writeInterval   10;


purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable no;

adjustTimeStep no;

maxAlphaCo 0.5;

maxDeltaT       1;

libs ("libtwoPhaseValidation.so"); 

functions
{
    advectInterface 
    {
        type harmonic;
        baseType shear;

        period 3;
        phaseShift 0; 

        cellVelocityName U; 
        volFluxName phi; 
    }

}


// ************************************************************************* //
